package metanit.base

/**
 * Конструкция when проверяет значение некоторого объекта и в зависимости от
 * его значения выполняет тот или иной код.
 */
fun main() {
    val a = 12
    val b = 44
    val c = 32
    val res: Int

    //Конструкция when аналогично конструкции if..else.
    when {
        a > b -> {
            println("a > b")
            res = a
        }
        a < b -> {
            println("a < b")
            res = b
        }
        else -> {
            println("a = b")
            res = a
        }
    }
    println(res)

    val f = when(a) {
        4 -> 4
        in 1..3 -> 4//Также можно сравнивать с целым диапазоном значений с помощью оператора in.
        27, 12 -> 33//Можно определить одни и те же действия сразу для нескольких значений. В этом случае значения перечисляются через запятую.
        else -> 5
    }
    println(f)

    //when может принимать динамически вычисляемый объект:
    when(a) {
        b - c -> println("a = b - c")
        b + c -> println("a = b + c")
    }

    //Вот так по идее можно округлять будет лот в алготрейдинге.
    val range = 455
    val r = when(range) {
        in 1..500 -> 500
        in 501..1000 -> 1000
        else -> 2000
    }
    println(r)
}