package metanit.base

/**
 * Диапазон представляет набор значений или неокторый интервал. Для создания диапазона применяется оператор ..
 */
fun main() {
    //С помощью специальной функции downTo можно построить диапазон в обратном порядке.
    //Еще одна специальная функция step позволяет задать шаг, на который будут изменяться последующие элементы:
    val range1 = 10 downTo 1 step 2
    for (i in range1) {
        print("$i  ")
    }
    println()

    //Еще одна функция until позволяет не включать верхнюю границу в диапазон:
    val range2 = 1 until 17 step 4
    for (i in range2) {
        print("$i  ")
    }
    println()

    //С помощью специальных операторов можно проверить наличие или отсутствие элементов в диапазоне:
    val isInRange = 15 in range2
    println(isInRange)
    println("${2 !in range2}")
}