package metanit.base

import java.math.BigInteger

//Типы данных.

fun main() {
    //Целочисленные типы.

    val a: Byte = -121//Хранит целое число от -128 до 127 и занимает 1 байт.
    val aa: UByte = 205u//Хранит целое число от 0 до 255 и занимает 1 байт. Здесь необходимо добавлять для значений беззнаковых u.
    val b: Short = -577//Хранит целое число от -32 768 до 32 767 и занимает 2 байта.
    val bb: UShort = 21000u//Хранит целое число от 0 до 65 535 и занимает 2 байта.
    val c: Int = -484849494//Хранит целое число от -2 147 483 648 (-231) до 2 147 483 647 (231 - 1) и занимает 4 байта.
    val cc: UInt = 484848930u//Хранит целое число от 0 до 232 - 1 и занимает 4 байта.
    val d: Long = -455555//Хранит целое число от –9 223 372 036 854 775 808 (-263) до 9 223 372 036 854 775 807 (263-1) и занимает 8 байт.
    val dd: ULong = 59595959595u//Хранит целое число от 0 до 264-1 и занимает 8 байт.
    //Ниже происходят неявные преобразования.
    val num1 = 3//Если мы инициализируем переменную литералом целочисленным, без указания типа, то тип будет Int.
    val num2 = 4u//А здесь будет UInt.
    val num3 = 56L//А здесь будет Long.
    val num4 = 45UL//А здесь будет ULong.
    val big = BigInteger("484848484848484848488959599")//Если хочется хранить ну очень большое число, то подключаем BigInteger.
    println("$a\t$aa\t$b\t$bb\t$c\t$cc\t$d\t$dd\t$num1, $num2, $num3, $num4 \t big = $big.")
    //Кроме чисел в десятичной системе мы можем определять числа в двоичной и шестнадцатеричной системах.
    val n1 = 0xFFB27
    val n2 = 0b1101
    println("n1 = $n1, n2 = $n2.")


    //Числа с плавающей точкой.
    val e = 3.45//Здесь переменная будет неявно приведена к типу Double. Хранит число с плавающей точкой от ±5.0*10-324 до ±1.7*10308 и занимает 8 байта.
    val ee: Float = 5.9F//Хранит число с плавающей точкой от -3.4*1038 до 3.4*1038 и занимает 4 байта.
    println("$e $ee")
    //Также тип Double поддерживает экспоненциальную запись:
    val e2 = 23e6
    val e3 = 0.3e-4
    println("$e2 $e3.")


    //Логический тип Boolean.

    //Тип Boolean может хранить одно из двух значений: true (истина) или false (ложь).
    val bool1 = true
    println(bool1)

    //Символы.

    //Символьные данные представлены типом Char.
    //Он представляет отдельный символ, который заключается в одинарные кавычки.
    val ch = '{'
    println(ch)
    //Также тип Char может представлять специальные последовательности, которые интерпретируются особым образом:
    // \t: табуляция
    // \n: перевод строки
    // \r: возврат каретки
    // \': одинарная кавычка
    // \": двойная кавычка
    // \\: обратный слеш
    println("a\\b")


    //Строки.

    val t = "Hello"
    println(t)
    val tt = "Hello my \"friend\"!"
    println(tt)
    val text = """
        Мой дядя
        Самых честных правил...
    """.trimIndent()
    println(text)
    //Шаблоны строк (string templates):
    val age = 89
    println("I'm $age years old.")


    //Kotlin предоставляет нам ряд встроенных функций для преобразования данных к определенному типу:
    val nnnn = "7"
    val num5 = nnnn.toInt()
    print("$num5.\n")//Запись аналогична println("$num5.").

    //В Kotlin также есть тип Any, который позволяет присвоить переменной данного типа любое значение:
    var anyThing: Any = 4
    println(anyThing)
    anyThing = "Hi!"
    println(anyThing)
}