package metanit.base

/**
 * В этом разделе рассмотрены основные арифметические операции с числами.
 * Но я не стал рассматривать поразрядные операции, так как не планирую
 * их использовать в своих проектах.
 */
fun main() {
    val a = 9
    val b = 4
    val d = 1.1
    var c = a / b//Здесь будет целое значение, а дробная часть отбросится.
    println(c)
    c = a / d.toInt()
    val f = a / d//Здесь будет дробное значение.
    println(f)
    println(c)
    c *= a//Это операция присвоения с увеличением в столько то раз.
    println(c)
    c = a % b//%: возвращает остаток от целочисленного деления двух чисел.
    println(c)
    println()

    //++ (инкремент): увеличивает значение на единицу.
    //Префиксный инкремент возвращает увеличенное значение:
    var n = 3
    c = ++n
    println("n = $n  c = $c.")
    //Постфиксный инкремент возвращает значение до увеличения на единицу:
    n = 3
    c = n++
    println("n = $n  c = $c.")

    //-- (декремент): уменьшает значение на единицу.
    //Префиксный декремент возвращает уменьшенное значение:
    n = 3
    c = --n
    println("n = $n  c = $c.")
    //Постфиксный декремент возвращает значение до уменьшения на единицу:
    n = 3
    c = n--
    println("n = $n  c = $c.")
}