package metanit.base

/**
 * В этом разделе рассмотрены условные выражения.
 * Условные выражения представляют некоторое условие, которое возвращает
 * значение типа Boolean: либо true (если условие истинно), либо false (если условие ложно).
 */
fun main() {
    val a = 7
    print("Введите число:  ")
    val b = readln()
    val d = a > b.toInt()
    println(d)
    if (d) {
        println("Введённое число меньше 7.")
    } else if (a == b.toInt()) println("Введённое число равно 7.")
    else println("Введённое число больше 7.")
    println()

    //Логические операции.
    /*
    Операндами в логических операциях являются два значения типа
    Boolean. Нередко логические операции объединяют несколько операций отношения:
     */
    //Логические операции.
    //Работают только с Bool'ами, то есть с тем, что уже получилось из операций отношения,
    //а операции отношения (операции сравнения) -
    //это операции, которые сравнивают два значения и возвращают Boolean (true / false).
    val dd = (a > b.toInt()) || (a == b.toInt())
    println(dd)
    print("Введённое число меньше либо равно 7.")
}